In [1]:
#pandas 
#uses of pandas
#Data cleaning, normalization and transformation
#designed for working with tabular or heterogeneous data(diverse in nature can consists of different types,formats,structures and sources)

In [33]:
import pandas as pd
import numpy as np

In [3]:
#series - A series of data (1 dimensional)
#Dataframes - Tabular data (2 dimensional)

In [4]:
marks = pd.Series([80,70,60])

In [5]:
marks

0    80
1    70
2    60
dtype: int64

In [6]:
marks[1]

70

In [7]:
#specifying indexes

In [8]:
marks = pd.Series([80,70,90], index=['ali','ahmed','sarim'])

In [9]:
marks['ali']

80

In [10]:
#datatypes

In [11]:
age = pd.Series([22,21,20],index=['ali','ahmed','sarim'],dtype='float')

In [12]:
age

ali      22.0
ahmed    21.0
sarim    20.0
dtype: float64

In [13]:
#some conditions

In [14]:
age[age>20]#filtering

ali      22.0
ahmed    21.0
dtype: float64

In [15]:
age[['sarim','ali']] #fancy indexing

sarim    20.0
ali      22.0
dtype: float64

In [16]:
age['ahmed'] = 22#changing value

In [17]:
#Creating series using dictionary

In [18]:
age = pd.Series({'ali':23,'ahmed':22,'sarim':21})#key will become index and value will become the data

In [19]:
age

ali      23
ahmed    22
sarim    21
dtype: int64

In [20]:
pd.isnull(age)

ali      False
ahmed    False
sarim    False
dtype: bool

In [21]:
age.mean()

22.0

In [22]:
age1 = pd.Series([25,26],index=['sarim','ali'])

In [23]:
age+age1 #Adding data of two series

ahmed     NaN
ali      49.0
sarim    46.0
dtype: float64

In [ ]:
#Dataframes

In [25]:
students = pd.DataFrame ({
    'names':['sarim','ahmed','ali'],
    'age':[20,21,23],
    'cgpa':[3.6,3.5,3.8],
    'address':['gulshan','nazimabad','gulzar e hijri']
})

In [26]:
students

   names  age  cgpa         address
0  sarim   20   3.6         gulshan
1  ahmed   21   3.5       nazimabad
2    ali   23   3.8  gulzar e hijri

In [27]:
students.columns

Index(['names', 'age', 'cgpa', 'address'], dtype='object')

In [28]:
students['names']

0    sarim
1    ahmed
2      ali
Name: names, dtype: object

In [29]:
students[['names','cgpa','address']]

   names  cgpa         address
0  sarim   3.6         gulshan
1  ahmed   3.5       nazimabad
2    ali   3.8  gulzar e hijri

In [30]:
students[students['age']>20] #Students with age greater than 20 filtering

   names  age  cgpa         address
1  ahmed   21   3.5       nazimabad
2    ali   23   3.8  gulzar e hijri

In [31]:
students.age

0    20
1    21
2    23
Name: age, dtype: int64

In [32]:
students.names

0    sarim
1    ahmed
2      ali
Name: names, dtype: object

In [38]:
students['semester'] =  np.arange(1,4)

In [39]:
students

   names  age  cgpa         address  semester
0  sarim   20   3.6         gulshan         1
1  ahmed   21   3.5       nazimabad         2
2    ali   23   3.8  gulzar e hijri         3